const dateOffset = 9 * 1000; // 学校时间偏移

const nextDayTime = "21:15:00"; // 课表刷新时间
const weekStartDate = new Date(2023, 7, 28); // $ 开学第一周第一天的时间

// 课程阴影颜色
const coursesColorMap = {
    "语": "#ff0000",
    "数": "#00c2ff",
    "英": "#ff9900",

    "物": "#c10ce9",
    "化": "#00c2ff",
    "生": "#8fde5d",
    "政": "#cd5c5c",

    "听": "#cd5c5c",

    "体": "#ff9999",
    "心": "#ff9999",
    "信": "#ff9999",
    "通": "#ff9999",
    "劳": "#ff9999",

    "班": "#f2a65e",
    "跑": "#f2a65e",
    "自": "#c10ce9",

    "欢": "red",
    "迎": "orange",
    "各": "yellow",
    "位": "green",
    "家": "skyblue",
    "长": "purple",

    "测": "#996699",
};

const coursesFullNameMap = {
    "语": "语文",
    "数": "数学",
    "英": "英语",

    "物": "物理",
    "化": "化学",
    "生": "生物",
    "政": "政治",

    "听": "听力",

    "体": "体育",
    "心": "心理",
    "信": "信息与技术",
    "通": "通用技术",
    "劳": "劳动",

    "班": "班会",
    "跑": "跑操",
    "自": "自习",
    "测": "周测",
}

const headFullNameMap = {
    "早": "早读",
    "一": "第一节",
    "二": "第二节",
    "三": "第三节",
    "四": "第四节",
    "五": "第五节",
    "午": "午读",
    "六": "第六节",
    "七": "第七节",
    "八": "第八节",
    "课服": "课后服务",
    "晚一": "晚自习第一节",
    "晚二": "晚自习第二节",
    "晚三": "晚自习第三节",
    "测": "周测",
}